# 2 - Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности. 
# Не использовать множества.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]


array = [1,1,1,1,2,1,3,4,8,9,0,8,7,1,2,3,4,5,4,4,4,5,5,6,2,2,3,3,3,4]
new_array = []

for i in range(0, len(array)):
    for j in range(0,len(array)):
        if(array[i] == array[j] and i == j and new_array.count(array[i]) < 1):
            new_array.append(array[i])
            
    

print(new_array)
